{"artist": "Leonard Cohen", "title": "Hallelujah", "original_link": "https://genius.com/Leonard-cohen-hallelujah-lyrics", "lyrics": "[Verse 1]\nNow I've heard there was a secret chord\nThat David played and it pleased the Lord\nBut you don't really care for music, do ya?\nIt goes like this, the fourth, the fifth\nThe minor fall, the major lift\nThe baffled king composing \"Hallelujah\"\n\n[Chorus]\nHallelujah, Hallelujah\nHallelujah, Hallelujah\n\n[Verse 2]\nYour faith was strong, but you needed proof\nYou saw her bathing on the roof\nHer beauty in the moonlight overthrew ya\nShe tied you to a kitchen chair\nShe broke your throne and she cut your hair\nAnd from your lips she drew the Hallelujah\n\n[Chorus]\nHallelujah, Hallelujah\nHallelujah, Hallelujah\n\n[Verse 3]\nYou say I took the name in vain\nI don't even know the name\nBut if I did, well, really, what's it to ya?\nThere's a blaze of light in every word\nIt doesn't matter which you heard\nThe holy or the broken Hallelujah\n[Chorus]\nHallelujah, Hallelujah\nHallelujah, Hallelujah\n\n[Verse 4]\nI did my best, it wasn't much\nI couldn't feel, so I tried to touch\nI've told the truth, I didn't come to fool ya\nAnd even though it all went wrong\nI'll stand before the lord of song\nWith nothing on my tongue but hallelujah\n\n[Chorus]\nHallelujah, Hallelujah\nHallelujah, Hallelujah\nHallelujah, Hallelujah\nHallelujah, Hallelujah\nHallelujah, Hallelujah\nHallelujah, Hallelujah\nHallelujah, Hallelujah\nHallelujah, Hallelujah\nHallelujah, Hallelujah\n\n[Outro]\nHallelujah, Hallelujah\n[Additional Lyrics]\nBaby, I've been here before\nI know this room, I've walked this floor\nI used to live alone before I knew you\nAnd I've seen your flag on the marble arch\nLove is not a victory march\nIt's a cold and it's a broken Hallelujah\n\n[Additional Lyrics]\nThere was a time you let me know\nWhat's really going on below\nBut now you never show it to me, do you?\nAnd remember when I moved in you\nThe holy dove was moving too\nAnd every breath we drew was Hallelujah\n\n[Additional Lyrics]\nMaybe there's a God above\nBut all I've ever learned from love\nWas how to shoot at someone who outdrew you\nAnd it's not a cry that you hear at night\nIt's not somebody who's seen the light\nIt's a cold and it's a broken Hallelujah"}